{"meta":{"title":"Alex Gu's Blog","subtitle":"","description":"","author":"Alex Gu","url":"http://ghckodak.github.io","root":"/"},"pages":[{"title":"404 Not Found","date":"2020-06-17T15:42:48.932Z","updated":"2020-06-17T15:42:48.932Z","comments":true,"path":"404.html","permalink":"http://ghckodak.github.io/404.html","excerpt":"","text":"404 你居然发现了一个不存在的页面 可能是输入地址有误或该地址已被删除"},{"title":"摄影","date":"2020-06-17T15:52:32.686Z","updated":"2020-06-17T15:52:32.686Z","comments":true,"path":"photography/index.html","permalink":"http://ghckodak.github.io/photography/index.html","excerpt":"","text":""},{"title":"所有分类","date":"2020-06-17T15:39:52.893Z","updated":"2020-06-17T15:39:52.893Z","comments":true,"path":"categories/index.html","permalink":"http://ghckodak.github.io/categories/index.html","excerpt":"","text":""},{"title":"所有标签","date":"2020-06-17T15:40:34.063Z","updated":"2020-06-17T15:40:34.063Z","comments":true,"path":"tags/index.html","permalink":"http://ghckodak.github.io/tags/index.html","excerpt":"","text":""},{"title":"关于","date":"2020-06-17T15:35:44.763Z","updated":"2020-06-17T15:35:44.763Z","comments":true,"path":"about/index.html","permalink":"http://ghckodak.github.io/about/index.html","excerpt":"","text":"下面写关于自己的内容"}],"posts":[{"title":"测试","slug":"测试","date":"2020-06-16T23:03:44.000Z","updated":"2020-06-19T22:36:53.656Z","comments":true,"path":"2020/06/16/测试/","link":"","permalink":"http://ghckodak.github.io/2020/06/16/%E6%B5%8B%E8%AF%95/","excerpt":"这就是一篇测试文章","text":"这就是一篇测试文章 Markdown语法测试小标题三四五最多可以有六个层级的小标题代码示例， System.out.println(&quot;&quot;) 斜体 quote测试，可以用来打注释-Alex Gu 代码格， 用java编写 123if(a)&#123; return 1+2==4&#125; 其他的测试 层级不同 @还可以有复选样式 12345function fancyAlert(arg) &#123; if(arg) &#123; $.facebox(&#123;div:'#foo'&#125;) &#125;&#125;","categories":[],"tags":[{"name":"test","slug":"test","permalink":"http://ghckodak.github.io/tags/test/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-06-15T22:39:03.273Z","updated":"2020-06-17T21:04:08.602Z","comments":true,"path":"2020/06/15/hello-world/","link":"","permalink":"http://ghckodak.github.io/2020/06/15/hello-world/","excerpt":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub.","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"Do we need expensive, professional equipment for photograph?","slug":"我们需要好的摄影器材吗","date":"2018-03-21T15:55:29.000Z","updated":"2020-06-17T20:42:20.454Z","comments":true,"path":"2018/03/21/我们需要好的摄影器材吗/","link":"","permalink":"http://ghckodak.github.io/2018/03/21/%E6%88%91%E4%BB%AC%E9%9C%80%E8%A6%81%E5%A5%BD%E7%9A%84%E6%91%84%E5%BD%B1%E5%99%A8%E6%9D%90%E5%90%97/","excerpt":"Many photograph lovers buy lots of professional equipment’s and spend lots of money on it. However, some photographers take fantastic photos only with old shooting camera. There is an argument of whether it is necessary to buy expensive equipment’s for photograph. My opinion is, we don’t need.","text":"Many photograph lovers buy lots of professional equipment’s and spend lots of money on it. However, some photographers take fantastic photos only with old shooting camera. There is an argument of whether it is necessary to buy expensive equipment’s for photograph. My opinion is, we don’t need. It is undeniable that having a good professional camera benefit a lot for photographing. A professional camera can take photos which have higher resolution, higher saturation and contrast, and have more details. Some cameras, such like Leica, can even take photos with the smooth feeling of oil painting. Photographers call this “the German feeling”. The most important, a good professional camera can express your ideas clearly. It can focuses more quickly and accurately which can let you shot the view that fading in second. Photo taken by Leica. The tone is a little dark. However, it creates an oil painting feeling, which is the most attractive part of Leica cameras. Example of different focus points. Photographer’s idea is to shot the girl behind the flowers. However,a bad quaility camera may choose the wrong object to focus,like the photo on the right. The girl can not be seen clearly as a result. ​For nightscape photograph, a good camera is especially important. The lack of night needs camera to increase photosensitivity (ISO) and exposure for a longer time. Therefore, noise points become obvious. The number of noise points is proportional to ISO number, but the quality of camera also influences a lot. A quality camera has advanced light sensor and complex calculating procedures to alleviate noise points. Comparison of different noise points, caused by different ISO numbers. High noise makes photos look dirty, which is insufferable for photographers. However, have a professional camera doesn’t mean you can shot wonderful photos. In fact, the most important part of a photograph is not beautiful colors and high resolution, it’s composition, or the story behind photo. Some beautiful photos are taken by expensive professional equipment, but they are just beautiful with no meaningful content. They are called “Syrups”. None of them become famous. Therefore, a really good photo focus on composition and ideas, which can’t be achieved only by a good camera. Grand Prize of 2017 Nikon Photo Contest. The photo is black and white, and it is even not clear enough. However, the light ray shines on the workers’ bodies create a feeling of stone status, which is quite impressive. It reveals the life of workers. Moreover, traditional camera is not portable. Usually it weighs more than 1kg, if you want to bring another equipment like tripod, the weight will be heavier. It is tired to carry them. Fortunately, phone’s camera is become better and better. They can take high resolution photos and 4K videos, even have advanced functions like HDR, anti-shake, optical zoom…Some cellphone companies, for example, Huawei and Nokia, even work with famous camera manufacturers like Leica and Zeiss. Therefore, the performance of photo has a huge improvement. More and more photographers are using phones to street snap. The convenience makes them catch the life’s beautiful more easily. Professional photograph equipment. Including camera, tripod, backup battery, flashing light, cable release, GoPro, drone, backpack, cleaning tools.. Huawei works with Leica, while Nokia works with Zeiss. Their cameras have high perfermances. Some phones have “professional mode” for cameras. This mode let users modify every parameter manually. This is Huawei’s professional mode, which is very similar to SLR cameras. Photograph doesn’t need professional equipment. It only needs your thoughts, ideas and attitude to life. When you catch the fleeting view in the life, photo becomes photograph. I took this photo when I was waitting for subway at night.","categories":[{"name":"photography","slug":"photography","permalink":"http://ghckodak.github.io/categories/photography/"}],"tags":[{"name":"photography","slug":"photography","permalink":"http://ghckodak.github.io/tags/photography/"}]}],"categories":[{"name":"photography","slug":"photography","permalink":"http://ghckodak.github.io/categories/photography/"}],"tags":[{"name":"test","slug":"test","permalink":"http://ghckodak.github.io/tags/test/"},{"name":"photography","slug":"photography","permalink":"http://ghckodak.github.io/tags/photography/"}]}